#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/thclpr/default/runs/run-9RxkMFGBmDZa9MXS

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.rg_aks.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/aks-default-rg]
module.rg_vnet.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default]
module.vnet.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
module.vnet.azurerm_subnet.subnet["nodes"]: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/nodes]
module.vnet.azurerm_subnet_network_security_group_association.nsga["nodes"]: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/virtualNetworks/vnet-default/subnets/nodes]
module.aks.azurerm_kubernetes_cluster.k8: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourcegroups/aks-default-rg/providers/Microsoft.ContainerService/managedClusters/aks-default]
module.nsg_rules["allow_http"].azurerm_network_security_rule.nsr: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourceGroups/vnet-default-rg/providers/Microsoft.Network/networkSecurityGroups/nsg-default/securityRules/allow_http]
module.aks_nodepool["user"].azurerm_kubernetes_cluster_node_pool.pool: Refreshing state... [id=/subscriptions/53523e15-121c-4f24-afc0-60f4cf804085/resourcegroups/aks-default-rg/providers/Microsoft.ContainerService/managedClusters/aks-default/agentPools/user]
helm_release.releases: Refreshing state... [id=ingress-nginx]
module.aks_namespace["app"].kubernetes_namespace.ns: Refreshing state... [id=app]
kubernetes_ingress.ingress["nodeapi"]: Refreshing state... [id=app/nodeapi]
module.aks_role["nodeapi"].kubernetes_role.r: Refreshing state... [id=default/nodeapi]
module.aks_service_account["nodeapi"].kubernetes_service_account.sa: Refreshing state... [id=app/nodeapi]
module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb: Refreshing state... [id=app/nodeapi]
module.aks_deployment["nodeapi"].kubernetes_deployment.deploy: Refreshing state... [id=app/dev]
module.aks_service["nodeapi"].kubernetes_service.svc: Refreshing state... [id=app/nodeapi]
module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa: Refreshing state... [id=app/nodeapi]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.aks_hpa["nodeapi"].kubernetes_horizontal_pod_autoscaler.hpa has been changed
  ~ resource "kubernetes_horizontal_pod_autoscaler" "hpa" {
        id = "app/nodeapi"

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "nodeapi"
          ~ resource_version = "2385" -> "2445"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }
  # module.aks_deployment["nodeapi"].kubernetes_deployment.deploy has been changed
  ~ resource "kubernetes_deployment" "deploy" {
        id               = "app/dev"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "dev"
            # (4 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {
              ~ metadata {
                  + annotations = {}
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                  + node_selector                    = {}
                    # (10 unchanged attributes hidden)

                  ~ affinity {

                      ~ pod_anti_affinity {
                          ~ preferred_during_scheduling_ignored_during_execution {
                                # (1 unchanged attribute hidden)

                              ~ pod_affinity_term {
                                  + namespaces   = []
                                    # (1 unchanged attribute hidden)

                                  ~ label_selector {
                                      + match_labels = {}

                                        # (1 unchanged block hidden)
                                    }
                                }
                            }
                        }
                        # (1 unchanged block hidden)
                    }

                  ~ container {
                      + args                       = []
                      + command                    = []
                        name                       = "nodeapi"
                        # (7 unchanged attributes hidden)



                        # (3 unchanged blocks hidden)
                    }
                }
            }
            # (2 unchanged blocks hidden)
        }
    }
  # module.aks_service["nodeapi"].kubernetes_service.svc has been changed
  ~ resource "kubernetes_service" "svc" {
        id                     = "app/nodeapi"
        # (2 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "nodeapi"
            # (4 unchanged attributes hidden)
        }

      ~ spec {
          + external_ips                = []
          + load_balancer_source_ranges = []
            # (6 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }
  # module.aks_namespace["app"].kubernetes_namespace.ns has been changed
  ~ resource "kubernetes_namespace" "ns" {
        id = "app"

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "app"
            # (3 unchanged attributes hidden)
        }
    }
  # module.aks_service_account["nodeapi"].kubernetes_service_account.sa has been changed
  ~ resource "kubernetes_service_account" "sa" {
        id                              = "app/nodeapi"
        # (2 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
            name             = "nodeapi"
            # (5 unchanged attributes hidden)
        }
    }
  # module.aks_role_binding["nodeapi"].kubernetes_role_binding.rb has been changed
  ~ resource "kubernetes_role_binding" "rb" {
        id = "app/nodeapi"

      ~ metadata {
          + annotations      = {}
            name             = "nodeapi"
            # (5 unchanged attributes hidden)
        }


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aks_deployment["nodeapi"].kubernetes_deployment.deploy must be replaced
-/+ resource "kubernetes_deployment" "deploy" {
      ~ id               = "app/dev" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
          ~ name             = "dev" -> "nodeapi" # forces replacement
          ~ resource_version = "2382" -> (known after apply)
          ~ uid              = "9204c74a-614c-4314-980c-a6a6c638b1b0" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ selector {
              ~ match_labels = { # forces replacement
                  ~ "app" = "dev" -> "nodeapi"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ labels           = {
                      ~ "app" = "dev" -> "nodeapi"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ affinity {

                      ~ pod_anti_affinity {
                          ~ preferred_during_scheduling_ignored_during_execution {
                                # (1 unchanged attribute hidden)

                              ~ pod_affinity_term {
                                  - namespaces   = [] -> null
                                    # (1 unchanged attribute hidden)

                                  ~ label_selector {
                                      - match_labels = {} -> null

                                      ~ match_expressions {
                                          ~ values   = [
                                              - "dev",
                                              + "nodeapi",
                                            ]
                                            # (2 unchanged attributes hidden)
                                        }
                                    }
                                }
                            }
                        }
                        # (1 unchanged block hidden)
                    }

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "nodeapi"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                                # (3 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            name           = "http"
                            # (2 unchanged attributes hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @thcp, Action: `pull_request`*